# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [2]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [3]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [4]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [5]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [6]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./images/pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="./images/pagila_star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [144]:
%%sql
drop table IF EXISTS dimDate;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [145]:
%%sql
CREATE TABLE dimDate
(
    date_key integer PRIMARY KEY,
    date  date NOT NULL,
    year integer NOT NULL,
    quarter integer NOT NULL,
    month integer NOT NULL,
    day integer NOT NULL,
    week integer NOT NULL,
    is_weekend boolean NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [146]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [35]:
%%sql
select * from dimDate limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(20170407, datetime.date(2017, 4, 7), 2017, 2, 4, 7, 14, False),
 (20170130, datetime.date(2017, 1, 30), 2017, 1, 1, 30, 5, False),
 (20170318, datetime.date(2017, 3, 18), 2017, 1, 3, 18, 11, True),
 (20170426, datetime.date(2017, 4, 26), 2017, 2, 4, 26, 17, False),
 (20170215, datetime.date(2017, 2, 15), 2017, 1, 2, 15, 7, False)]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [118]:
%%sql
drop table if exists dimCustomer;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [119]:
%%sql
CREATE TABLE dimCustomer
(
    customer_key SERIAL PRIMARY KEY,
    customer_id integer NOT NULL,
    first_name text NOT NULL,
    last_name text NOT NULL,
    email text,
    address text NOT NULL,
    address2 text,
    district text NOT NULL,
    city text NOT NULL,
    country text NOT NULL,
    postal_code text NOT NULL,
    phone text,
    active integer,
    create_date date,
    start_date date,
    end_date date
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [120]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT DISTINCT(c.customer_id)                       AS customer_key,
       c.customer_id                                 AS customer_id,
       c.first_name                                  AS fist_name,
       c.last_name                                   AS last_name,
       c.email                                       AS email,
       a.address                                     AS address,
       a.address2                                    AS address2,
       a.district                                    AS district,
       ci.city                                       AS city,
       co.country                                    AS country,
       a.postal_code                                 AS postal_code,
       a.phone                                       AS phone,
       c.active                                      AS active,
       c.create_date                                 AS create_date,
       now()                                         AS start_date,
       now()                                         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [125]:
%%sql
DROP TABLE IF EXISTS dimMovie;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [126]:
%%sql
CREATE TABLE dimMovie
(
    movie_key SERIAL PRIMARY KEY,
    film_id integer NOT NULL,
    title text NOT NULL,
    description text,
    release_year integer,
    language text NOT NULL,
    original_language text,
    rental_duration integer NOT NULL,
    length integer NOT NULL,
    rating text NOT NULL,
    special_features text
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [127]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language,
                      original_language, rental_duration, length, rating, special_features)
SELECT f.film_id     AS movie_key,
       film_id,
       title,
       description,
       release_year,
       l.name AS language,
       orig_lang.name AS original_language,
       rental_duration,
       length,
       rating,
       special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [124]:
%%sql
select * from dimmovie limit 2;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(441, 441, 'HUNTER ALTER', 'A Emotional Drama of a Mad Cow And a Boat who must Redeem a Secret Agent in A Shark Tank', 2006, 'English', None, 5, 125, 'PG-13', '{Commentaries,"Deleted Scenes","Behind the Scenes"}'),
 (173, 173, 'CONFESSIONS MAGUIRE', 'A Insightful Story of a Car And a Boy who must Battle a Technical Writer in A Baloon', 2006, 'English', None, 7, 65, 'PG-13', '{"Behind the Scenes"}')]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [128]:
%%sql
DROP TABLE IF EXISTS dimStore

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [129]:
%%sql
CREATE TABLE dimStore
(
    store_key SERIAL PRIMARY KEY,
    store_id integer NOT NULL,
    address text NOT NULL,
    address2 text,
    district text NOT NULL,
    city text NOT NULL,
    country text NOT NULL,
    postal_code text,
    manager_first_name text,
    manager_last_name text,
    start_date date NOT NULL,
    end_date date NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [131]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code,
                     manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id    AS store_key,
       s.store_id,
       a.address,
       address2,
       district,
       city,
       country,
       postal_code,
       st.first_name AS manager_first_name,
       st.last_name AS manager_last_name,
       now() start_date,
       now() end_date
FROM store s
JOIN address a              ON (s.address_id=a.address_id)
JOIN city ci                ON (a.city_id = ci.city_id)
JOIN country co             ON (ci.country_id=co.country_id)
JOIN staff st               ON (s.manager_staff_id=st.staff_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

In [132]:
%%sql
select * from dimStore;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2020, 4, 29), datetime.date(2020, 4, 29)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2020, 4, 29), datetime.date(2020, 4, 29))]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [147]:
%%sql
DROP TABLE IF EXISTS factSales;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [148]:
%%sql
CREATE TABLE factSales
(
    sales_key    SERIAL PRIMARY KEY,
    date_key     INT NOT NULL REFERENCES dimDate(date_key),
    customer_key INT NOT NULL REFERENCES dimCustomer(customer_key),
    movie_key    INT NOT NULL REFERENCES dimMovie(movie_key),
    store_key    INT NOT NULL REFERENCES dimStore(store_key),
    sales_amount decimal(5,2) NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [154]:
%%sql
insert into factSales (sales_key, date_key, customer_key,
                       movie_key, store_key, sales_amount)
select
    distinct p.payment_id as sales_key,
    date_key,
    p.customer_id as customer_key,
    movie_key,
    i.store_id as store_key,
    p.amount as sales_amount
from payment p
JOIN dimDate on date(p.payment_date) = dimDate.date
JOIN rental r on (r.rental_id = p.rental_id)
JOIN inventory i on (r.inventory_id = i.inventory_id)
JOIN dimMovie on (i.inventory_id = dimMovie.film_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
3475 rows affected.

[]

In [158]:
%%sql
select store_key, sum(sales_amount) as tot
from factSales
group by store_key;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(2, Decimal('7452.59')), (1, Decimal('7208.69'))]